Repository: seanpm2001/mt-training-data
Catalog: ppl/ppl_pontoon.tmx
Source language: en_us
Languages: ppl

source: { -brand-short-name } is backed by the non-profit Mozilla, which administers a completely open certificate authority (CA) store. The CA store helps ensure that certificate authorities are following best practices for user security.
ppl: Mozilla kipalewia { -brand-short-name }. Yaja se organización te kineki kipiwilia tumin wan kitekimaka se tapiyaluyan tapujtuk ipal tatekimakalis ipal certificados (CA). Ne tapialuyan ipal CA kipalewia pal ma ne tatekimakalis ipal certificados kichiwikan ne tay yek pal kipalewia ne usuarioj.

source: { -brand-short-name } uses the Mozilla CA store to verify that a connection is secure, rather than certificates supplied by the user’s operating system. So, if an antivirus program or a network is intercepting a connection with a security certificate issued by a CA that is not in the Mozilla CA store, the connection is considered unsafe.
ppl: { -brand-short-name } kikwi ne tapiyaluyan Mozilla CA pal kita yek su ne musalulis te tesajsay, wan te kita ne certificadoj tay tamakak ne isistema operativo ne usuarioj. Kwakuni, asu se programa antivirus u se matapan nemi kitzkia se musalulis iwan se certificadoj tajpiyalis tay tamakak se CA ne tesu nemi tik ne tapiyaluyan Mozilla CA, ne musalulis nesis tesajsay.

source: en-US, en
ppl: ppl,es-MX,es,en-US,en

source: Firefox and the Firefox logos are trademarks of the Mozilla Foundation.
ppl: Firefox wan ne Firefox-ishkamet kisat itech ne tiankismachiut pal ne Mozilla Foundation.

source: { $hostname } uses an invalid security certificate.
ppl: { $hostname } kikwi se teyek certificado ipal tajpiyalis

source: Someone could be trying to impersonate the site and you should not continue.
ppl: Se akaj kiejekua nesi kenha ken ne sitioj pal metzshijshikua, kunij maka shikalaki.

source: The certificate is not trusted because it was issued by an invalid CA certificate.
ppl: Ne certificado tesu muyulmati ika se certificadoj CA tesu yek kititanij.

source: The certificate is not trusted because the issuer certificate is not trusted.
ppl: Ne certificadoj tesu muyulmati ika ne icertificadoj ne ká kititania tesu muyulmati.

source: Websites prove their identity via certificates. { -brand-short-name } does not trust { $hostname } because its certificate issuer is unknown, the certificate is self-signed, or the server is not sending the correct intermediate certificates.
ppl: Ne sitios tik ne matapan kiejekuat inhidentidad iwan ipalewika ne certificados. { -brand-short-name } tesu kiyulmati { $hostname } ika icertificado tesu mumati, ne certificado mutajkwilua isel, u ne servidor tesu kititania ne yejyek certificados intermedios.

source: Websites prove their identity via certificates, which are issued by certificate authorities.
ppl: Ne sitios web kita yek inhidentidad ipanpa certificados. Ini certificados kititaniat ne tatuktianimet ipal certificación.

source: Account deleted successfully
ppl: Mutapujka mupupujtuk

source: Account no longer exists. Recreate it?
ppl: Tapujka tea nemi. Tikneki tikchiwa uksepa?

source: Account notifications will now also be sent to %(secondaryEmail)s.
ppl: Tiktaniasket tanawatilis ipal mutapujka ka %(secondaryEmail)s.

source: Account notifications will now also be sent to %(secondaryEmailVerified)s.
ppl: Ne tanawatilis ipal mutapujka tiktaniat %(secondaryEmailVerified)s nusan.

source: Account picture
ppl: Itilkwil ne mutapujka

source: Account Recovery
ppl: Talajsilis ipal mutapujka

source: Account recovery enabled
ppl: Tikwelitiat ne talajsilis ipal mutapujka

source: Account recovery revoked
ppl: Talajsili ipal mutapujka te kiski yek

source: Account verified
ppl: Tikpepetaketa mutapujka

source: Add…
ppl: Shikachitili...

source: Cancel
ppl: Shikajkawa

source: Change...
ppl: Tikpata...

source: Change…
ppl: Tikpata...

source: Choose the name you would like to appear in Firefox and when managing your account.
ppl: Shikijkwilu mukwachtukay yu-nesi tik Firefox wan ken titajshitia.

source: Complete set-up by entering the new password on your other Firefox devices.
ppl: Shitajshiti nujme iwan ne yankwik taketzalis ichtaka kan tikwi Firefox.

source: Connected
ppl: Musalujtuk

source: Copied
ppl: Muishkupintuk

source: Display name
ppl: Shikneshti ne itukay

source: Display name updated
ppl: Mukwachtukay muyankwilijtuk

source: Downloaded
ppl: Mutemultijtuk

source: Email address
ppl: Itukay ne mucorreo

source: Email resent. Add accounts@firefox.com to your contacts to ensure a smooth delivery.
ppl: Titani mutitanijtuk ukpa. Shikishtili accounts@firefox.com mutenutzal pal tikwikwi yek muchi.

source: Failed to copy. Please manually copy.
ppl: Te welik muishkupina. Shikishkupina tajasan.

source: Firefox Recovery Codes
ppl: Codigo ipal talajsilis Firefox

source: Firefox Recovery Key
ppl: Codigo ipal talajsilis Firefox

source: Firefox Sync will resume momentarily
ppl: Firefox Sync tekitis uksenpa nemanha

source: Forgot password?
ppl: Tikelkaw ne taketzalis ichtaka?

source: If you lose access to your account, youll be able to restore your sync data.
ppl: Su te tiweli tikalaki tik mutapujka, tiwelis tikalana muchi ne dajdato.

source: Last active over %(translatedTimeAgo)s
ppl: Nemik nikan achka an %(translatedTimeAgo)s

source: Last active over %(translatedTimeAgo)s in %(translatedCountry)s
ppl: Nemik nikan achka an %(translatedTimeAgo)s tik %(translatedCountry)s

source: Last active over %(translatedTimeAgo)s near %(translatedCity)s, %(translatedState)s, %(translatedCountry)s
ppl: Nemik nikan achka an %(translatedTimeAgo)s inawak %(translatedCity)s, %(translatedState)s, %(translatedCountry)s

source: Last active %(translatedTimeAgo)s
ppl: Nemik nikan an %(translatedTimeAgo)s

source: Last active %(translatedTimeAgo)s in %(translatedCountry)s
ppl: Nemik nikan an %(translatedTimeAgo)s tik %(translatedCountry)s

source: Last active %(translatedTimeAgo)s near %(translatedCity)s, %(translatedState)s, %(translatedCountry)s
ppl: Nemik nikan an %(translatedTimeAgo)s inawak %(translatedCity)s, %(translatedState)s, %(translatedCountry)s

source: Last checked: %(lastCheckTime)s
ppl: Tikpepetaket ka %(lastCheckTime)s

source: Last seen over %(translatedTimeAgo)s
ppl: Tikitzki achka an %(translatedTimeAgo)s

source: Last seen over %(translatedTimeAgo)s in %(translatedCountry)s
ppl: Tikitzki achka an %(translatedTimeAgo)s tik %(translatedCountry)s

source: Last seen over %(translatedTimeAgo)s near %(translatedCity)s, %(translatedState)s, %(translatedCountry)s
ppl: Tikitzki achka an %(translatedTimeAgo)s inawak %(translatedCity)s, %(translatedState)s, %(translatedCountry)s

source: Last seen %(translatedTimeAgo)s
ppl: tikitzki an %(translatedTimeAgo)s

source: Last seen %(translatedTimeAgo)s in %(translatedCountry)s
ppl: Tikitzki an %(translatedTimeAgo)s tik %(translatedCountry)s

source: Last seen %(translatedTimeAgo)s near %(translatedCity)s, %(translatedState)s, %(translatedCountry)s
ppl: Tikitzki an %(translatedTimeAgo)s inawak %(translatedCity)s, %(translatedState)s, %(translatedCountry)s

source: Last sync over %(translatedTimeAgo)s
ppl: Dajdato muyankwilijtiwit achka an %(translatedTimeAgo)s

source: Last sync over %(translatedTimeAgo)s in %(translatedCountry)s
ppl: Dajdato muynakwilijtiwit achka an %(translatedTimeAgo)s tik %(translatedCountry)s

source: Last sync over %(translatedTimeAgo)s near %(translatedCity)s, %(translatedState)s, %(translatedCountry)s
ppl: Dajdato muyankwilitiwit achka an %(translatedTimeAgo)s inawak %(translatedCity)s, %(translatedState)s, %(translatedCountry)s

source: Last sync time unknown
ppl: Te mumati kan dajdato muyankwilijtiwit

source: Last sync %(translatedTimeAgo)s
ppl: Dajdato muyankwilijtiwit an %(translatedTimeAgo)s

source: Last sync %(translatedTimeAgo)s in %(translatedCountry)s
ppl: Dajdato muyankwilijtiwit an %(translatedTimeAgo)s tik %(translatedCountry)s

source: Last sync %(translatedTimeAgo)s near %(translatedCity)s, %(translatedState)s, %(translatedCountry)s
ppl: Dajdato muyankwilijtiwit %(translatedTimeAgo)s inawak %(translatedCity)s, %(translatedState)s, %(translatedCountry)s

source: New password
ppl: Yankwik taketalis ichtaka

source: New recovery codes generated
ppl: Yankwik codigo ipal talajsilis mutitanijtuk

source: none
ppl: te kanaj

source: Once you're finished, use your new password to sign in on all of your devices.
ppl: Keman titami, shikwi ne yankwik taketzalis ichtaka pal tiktalia mutukay ka nujme.

source: Open Gmail
ppl: Shiktapu Gmail

source: Open Hotmail
ppl: Shiktapu Hotmail

source: Open Outlook
ppl: Shiktapu Outlook

source: Open Restmail
ppl: Shiktapu Restmail

source: Open Yahoo
ppl: Shiktapu Yahoo

source: Other
ppl: Ukse

source: Over %(translatedTimeAgo)s
ppl: Achka an %(translatedTimeAgo)s

source: Over %(translatedTimeAgo)s in %(translatedCountry)s
ppl: Achka an %(translatedTimeAgo)s tik %(translatedCountry)s

source: Over %(translatedTimeAgo)s near %(translatedCity)s, %(translatedState)s, %(translatedCountry)s
ppl: Achka an %(translatedTimeAgo)s inawak %(translatedCity)s, %(translatedState)s, %(translatedCountry)s

source: Password
ppl: Taketzalis ichtaka

source: Password changed successfully
ppl: Tikpataka ne taketzalis ichtaka

source: Password reset
ppl: Shikchiwa mutaketzalis ichtaka uksenpa

source: Password reset successfully. Sign in to continue.
ppl: Mutaketzalis ichtaka mupatak. Shu shiktali mutkay.

source: %(permissionName)s (required)
ppl: Muneki %(permissionName)s

source: Please Select One
ppl: Shikpejpena se

source: Primary email set to %(email)s
ppl: Achtu itukay mucorreo pal %(email)s

source: Primary email verified
ppl: Tikpepetaketa ne itukay mucorreo

source: Primary email verified successfully
ppl: Ne achtu itukay mucorreo mupepetatuk yek

source: Printed
ppl: Tamakishtijtuk

source: Re-enter password
ppl: Taketzalis ichtaka uksenpa

source: Reset password
ppl: Shikchiwa taketzalis ichtaka uksenpa

source: Secondary email
ppl: Ukse itukay mucorreo

source: Secondary email removed
ppl: Ukse itukay mucorreo muishtijtuk

source: Secondary email verified
ppl: Ne ukse itukay mucorreo nemi yek

source: Sign in
ppl: Shiktali mutukay

source: Sign-in confirmed
ppl: Tiktalijtuk mutukay yek!

source: Start browsing
ppl: Tipewa titajtachia

source: Subscribed successfully
ppl: Timuijkwilujtuka

source: Thank you for reaching out to Mozilla Support about <b>%(escapedLowercaseTopic)s</b> for <b>%(escapedSelectedPlan)s</b>. We'll contact you via email as soon as possible.
ppl: Padiush tinechnawatia tik Tepalewilis Mozilla ipanpa <b>%(escapedLowercaseTopic)s</b> ika <b>%(escapedSelectedPlan)s</b>. Timetznutzasket iwan se titanti.

source: Thank you for reaching out to Mozilla Support about <b>%(escapedLowercaseTopic)s</b>. We'll contact you via email as soon as possible.
ppl: Padiush tinechnawatia tik Tepaliwilis Mozilla ipanpa <b>%(escapedLowercaseTopic)s</b>. Timetznutzasket iwan se titanti.

source: %(translatedTimeAgo)s in %(translatedCountry)s
ppl: %(translatedTimeAgo)s tik %(translatedCountry)s

source: %(translatedTimeAgo)s near %(translatedCity)s, %(translatedState)s, %(translatedCountry)s
ppl: %(translatedTimeAgo)s inawak %(translatedCity)s, %(translatedState)s, %(translatedCountry)s

source: Two-step Authentication
ppl: Tepepetalis unpa

source: Two-step authentication enabled
ppl: Tepepetalis unpa muwelitijtuk

source: Two-step authentication removed
ppl: Tepepetalis unpa muishtijtuk

source: Unknown account. <a href="/signup">Sign up</a>
ppl: Te muishmati ne tapujka. <a href="/signup"> kitalij itukay </a>

source: Use the code %(code)s to set up two-step authentication in supported applications.
ppl: Shikwi ne codigo %(code)s pal tikwelitia ne tepepetalis unpa, semaya kan weli muchiwa.

source: Verification email sent
ppl: Tiktitanijtiwit se correo pal tikpepetat

source: Web Session
ppl: Tanamikilis ipal tzawalamat

source: Web Session, %(userAgent)s
ppl: Tanamikilis ipal tzawalamat, %(userAgent)s

source: Welcome back
ppl: Yek timukweptuk

source: We're sorry to hear about this. If this was a device you really don't trust, you should change your Firefox Account password, and change any passwords saved in Firefox.
ppl: Te tiknekiskiat ma ini panu. Su ini tanuska tesu seguro, shikpata ne taketzalis ichtaka ipal mutapujka Firefox, wan nusan shikpata muchi taketzalis ichtaka tikwij tik Firefox.

source: We're sorry to hear about this. You should change your Firefox Account password, and look for information from your device manufacturer about erasing your data remotely.
ppl: Te tiknekiskiat ma ini panu. Shikpata ne taketzalis ichtaka ipal mutapujka Firefox wan shikishtemu ken tiweliskia tikpupua mudajdato ka nujme, kan tikwij.

source: You are now ready to make changes to your Firefox Account.
ppl: Tiwelia titajshitia tik mutapujka ipal Firefox.

source: You are now ready to use %(serviceName)s
ppl: Tiwelia tikwi %(serviceName)s

source: Your account has been locked for security reasons
ppl: Mutapujka mutzakwilijtuk ika muita tesajsay

source: Your password has been reset
ppl: Tikpatak mutaketzalis ichtaka

source: Your sync data is protected
ppl: Dajdato, ne tikyankwilijtuk, nakat seguro.

source: %1$s is requesting your username and password.
ppl: %1$s metztajtanilia muusuariojtukay wan muichtakataketzalis.

source: %2$s is requesting your username and password. The site says: “%1$s”
ppl: %2$s metztajtanilia muusuariojtukay wan muichtakataketzalis. Ne sitioj ina: “%1$s”

source: Accept the Risk and Continue
ppl: Nikwi ne riesgoj wan nipanu

source: Address Not Found
ppl: Ne dirección tesu muajsik

source: Advanced…
ppl: Chayawtuk…

source: Cannot Complete Request
ppl: Tesu welik muajshitia ne tajtanilis

source: Content crashed
ppl: Ne tay nemi kalijtik kichiwki tajtakul

source: Content Encoding Error
ppl: Tajtakul pal ne itasenputzulis ne tay nemi kalijtik.

source: Corrupted Content Error
ppl: Tatakul kalijtik palantuk

source: File Not Found
ppl: Tesu muajsituk ne archivoj

source: Go Back
ppl: Shimukwepa

source: Go Back (Recommended)
ppl: Shimukwepa (tanawatilis)

source: <label>Someone could be trying to impersonate the site and you should not continue.</label> <br><br> <label>Websites prove their identity via certificates. %1$s does not trust <b>%2$s</b> because its certificate issuer is unknown, the certificate is self-signed, or the server is not sending the correct intermediate certificates.</label>
ppl: <label>Se akaj kiejekua tashijshikua mukwepa ne sitioj wan te nemi pal tipanu.</label> <br><br> <label>Ne tzawalsitioj ina ka yajasan ipanpa certificados. %1$s tesu kineltuka <b>%2$s</b> ika ne kimaka certificados tesu muishmati, ne certificadoj kiwawasu itukey isel, u ne servidor tesu kititania ne yejyek certificados intermedioj.</label>

source: No internet connection
ppl: Te musalujtuk tech Internet

source: Offline Mode
ppl: Modoj kupintuk

source: <p>Additional information about this problem or error is currently unavailable.</p>
ppl: <p>Sanuk tesu nemi ukse informacion ipanpa ini uwijkayut u tajtakul.</p>

source: Port restricted for security reasons
ppl: Tesu weli kalaki tik ne puertoj ipanpa ne tajpiyalis.

source: Reload
ppl: Takimiltia senpa

source: Secure Connection Failed
ppl: Tesu welik muchiwa se musalulis seguruj

source: The connection has timed out
ppl: Ne tasalulis tamik

source: The connection was interrupted
ppl: Ne tasalulis kutunik

source: The connection was reset
ppl: Ne tasalulis mupewaltijtuk senpa.

source: The page at %1$s says:
ppl: Ne iswat tik %1$s ina:

source: The page isn’t redirecting properly
ppl: Ne iswat tesu yek tatijtitania senpa.

source: This website requires a secure connection.
ppl: Ini tzawalsitioj kineki se tasalulis seguroj.

source: Try Again
ppl: Shikejeku uksenpa

source: <ul> <li>The page you are trying to view cannot be shown because the authenticity of the received data could not be verified.</li> <li>Please contact the website owners to inform them of this problem.</li> </ul>
ppl: <ul> <li>Ne iswat taja tikneki tikita tesu weli muneshtia ika tesu weli tikneltia asu ijkia ne itukey ne datos tikwijtiwit .</li> <li>Shiknutza ne itejtekuyu ne sitioj matapan pal tiknawatilia ini uijkayu.</li> </ul>

source: <ul> <li>The page you are trying to view cannot be shown because this website requires a secure connection.</li> <li>The issue is most likely with the website, and there is nothing you can do to resolve it.</li> <li>You can notify the website’s administrator about the problem.</li> </ul>
ppl: <ul> <li>Ne iswat tikneki tikita tesu weli muneshtia ika ini sitioj matapan kineki se tasalulis seguruj.</li> <li>Ini uijkayu anka iwan ne sitioj matapan, wan tesu tiweli tikchiwa te tatka pal tikishtia.</li> <li>Tiweli tiknawatilia ne administrador pal ini sitioj ini uijkayu.</li> </ul>

source: <ul> <li>This could be a problem with the server’s configuration, or it could be someone trying to impersonate the server.</li> <li>If you have connected to this server successfully in the past, the error may be temporary, and you can try again later.</li> </ul>
ppl: <ul> <li>Ini anka se uijkayu iwan ne iconfiguración ne servidor, u anka se akaj kiejekua tashijshikua mukwepa ne servidor.</li> <li>Asu ikman taja timusalujtuk yek itech ini servidor, ne tatakul yu ishtuna chupi, wan tiweli taejekua nemanha.</li> </ul>

source: Unable to connect
ppl: Tesu welik musalua

source: Unexpected response from server
ppl: Ne servidor tesu nankilia ken muchiya.

source: Unsafe File Type
ppl: Ne tipoj archivoj tesajsay

source: 5 myths about password managers
ppl: 5 mijmitoj ipanpa ne tayektaliani ipal takezalis ichtaka

source: About { -product-name }
ppl: Ipanpa { -product-name }

source: <a>Create a free { -brand-fxa }</a>, and you can add up to 15 email addresses.
ppl: <a>Shikchiwa se takulijtuk { -brand-fxa }</a>, wan weli tiktalia san 15 titantukayit.

source: <a>Create an account</a> to monitor up to 15 email address for data breaches. We recommend adding any email addresses you’ve used to create online accounts.
ppl: <a>Shikchiwa se ishtapual</a> pal tikishkupawia san 15 titantukayit ipal tamatil taichtekilis. Tinat ma shiktali ankakeski titantukayit tikpia pal kichiwa ishtapal ka matapan.

source: Add a new email address
ppl: Shikachtili se yankwik correoj

source: Additional information, including:
ppl: Ukchupi información, wan nusan:

source: Advanced search in sensitive breaches
ppl: Tatemulis chupiuk yek ipal kaltapanalis tesajsay

source: Alert me about new breaches
ppl: Shinechnawati keman mukaltapanat uksenpa

source: All breaches in { -product-name }
ppl: Muchi ne mukaltapanalis tik { -product-name }

source: An update from { -product-name }
ppl: Se tayankwililis ipal { -product-name }

source: Appears in { $breachCount } known breaches.
ppl: Nesi tik { $breachCount } kajkaltapanalis majmatituk.

source: A strong password uses a combination of upper and lowercase letters, special characters, and numbers. It doesn’t contain personal info like your address, birthday, or family names.
ppl: Se taketzalis tajpaltik kikwi lejletraj wey wan chikitik, caracter especial, wan tapual. Te kipia intatka mupanpa ken mudirección, keman tinesik nan intujtukay mumiakwan.

source: Avoid using personal info in passwords
ppl: Maka shiktali información mupal tik ne taketzalis ichtaka

source: A website data breach happens when cyber criminals steal, copy, or expose personal information from online accounts. It’s usually a result of hackers finding a weak spot in the website’s security. Breaches can also happen when account information gets leaked by accident.
ppl: Se mukaltapanalis u keman se mukaltapana tik mudajdatoj, yaja ne taichtekit kishkupina wan kalkishtia wan kineshtia muinformación tik ne cuejcuentaj matapan. Panu seujseujti ika ne taichtekit kiajsit kan ne te uij welit mukaltapanat. Uni panu nusan keman ne información ne cuejcuentaj chulua.

source: Back to Top
ppl: Shimukwepa kan tipewa

source: { -brand-fxa } Email - Primary
ppl: { -brand-fxa } Correoj - Ne Achtu

source: { -brand-name } apps and services
ppl: { -brand-name } tekitatka wan tayekultilis

source: { -brand-name } Browser for Desktop
ppl: { -brand-name } Tachialuni pal Kutapech

source: { -brand-name } Browser for Mobile
ppl: { -brand-name } Tachialuni pal Matawikal

source: { -brand-name } browser not required for a { -brand-fxa }. You may receive info about { -brand-Mozilla } services.
ppl: Ne taiwan titajtachia { -brand-name } tesu muneki pal { -brand-fxa }. Tiweli tikpia información ipanpa tay ne tamaka { -brand-Mozilla }.

source: { -brand-name } is tech that fights for your online privacy.
ppl: { -brand-name } ne tepustekitilis ka kimanawia ne muichtakayu ka matapan.

source: { $breachCount } NEW BREACH FOUND
ppl: { $breachCount } UKSENPA MUKALTAPANKET

source: Breach data provided by { $hibp-link }
ppl: { $hibp-link } tamakak ne datoj ipanpa ne kaltapanalis

source: Breach date:
ppl: Keman kinekit kalakit ichtaka:

source: Breaches
ppl: Kaltapanalis

source: Breach Summary
ppl: Ne resumen ipal ne kaltapanilis

source: Breach summary for { $userEmail }
ppl: Ne itapualis ne tamatilichtekilis ipal { $userEmail }

source: Change password for this site
ppl: Shikpata ne ichtakatajkwilul ipal ini tzawalamat

source: Change Primary Email Address
ppl: Shikpata ne dirección ipan correoj ne nemi ka achtu

source: Change your password
ppl: Shikpata muichtakatajkwilul

source: Change your password to a strong, unique password.
ppl: Shikpata mutaketzalis ichtaka iwan seuk ukchupi tajpaltik wan te kenha seuk.

source: Check for Breaches
ppl: Shikpepeta kaltapanalis

source: Close menu
ppl: Shiktzakwa ne tatemulamat

source: Compromised accounts:
ppl: Cuejcuentaj ijtakujtuk:

source: Compromised data:
ppl: Keman ijtakawij:

source: Conduct a basic search
ppl: Shiktemu se chupi

source: Could not add email address to database.
ppl: Te tiktalijket ne amatitantukayit tik ne tamatilkimil.

source: Could not load breaches.
ppl: Te kineshtia keman kinekit kalakit ichtaka

source: Create a { -brand-fxa } for your full report of breaches and to get alerts.
ppl: Shikchiwa se { -brand-fxa } ipal ne reportej patawak ipanpa ne katapanalis wan pal tikpia tanawatilis.

source: Create a { -brand-fxa } to monitor your email for ongoing breaches. Once you’ve verified your email, you’ll also receive a full report of past breaches, including sensitive breaches.
ppl: Shikchiwa se { -brand-fxa } pal tikpepeta kaltapanalis wijwitz. Kan tikpepettuk mucorreoj, tiu-tikpia se reportej ipal muchi ne kaltapanalis panuket, nusan ne kipiat información ichtaka.

source: Create Account
ppl: Shikchiwa Ishtapual

source: Create unique passwords and save them somewhere safe, like a password manager.
ppl: Shikchiwa sechín tajtaketzalis ichtaka wan shikana né kan te weli mukishtia, ken se tayektaliani ipal taketzalis ichtaka.

source: Cyber criminals could find your password on the dark web and use it to log in to your other accounts. The best way to protect your accounts is to use unique passwords for each one.
ppl: Ne teyek takamet tik ne Matapan kiajsiskiat mutaketzalis ichtaka tik ne matapan kunyua wan kikwiskia pal kalaki tik sejseuk cuentaj mupal. Shikwi sanse taketzalis ichtaka pal sejse mucuentaj wan ijkiuni tiktajpia ukchupi yek.

source: Data Aggregator Breach
ppl: Kaltapanalis tik ne kiachitilia dajdatoj

source: Data Aggregator Breaches
ppl: Kaltapanalis tik ne tasentalilis ipal datos
